// Console.WriteLine("Введите первое число:");

// int a = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число:");

// int b = Convert.ToInt32(Console.ReadLine());
// {
// Console.WriteLine(a > b ? "Первое число больше второго" : "Второе число больше первого");
// } // 1 задание.

// internal class Program
// {
//     private static void Main(string[] args)
//     {
//         Console.WriteLine("Введите первое число:");

//         int a = Convert.ToInt32(Console.ReadLine());

//         Console.WriteLine("Введите второе число:");

//         int b = Convert.ToInt32(Console.ReadLine());

//         Console.WriteLine("Введите третье число:");

//         int c = Convert.ToInt32(Console.ReadLine());
//         {
//             Console.WriteLine(a > b ? "Первое число больше второго" : "Второе число больше первого");
//         }
//         Console.WriteLine(c > a ? "Третье число больше первого" : "Первое число больше третьего");
//         {
//         }
//     }
// } // 2 задание



 
// namespace ConsoleApplication1
// {
//     class Program
//     {
//         static void Main(string[] args)
//         {
//             int a;                             
//             Console.WriteLine("введите число: ");
//             a = Convert.ToInt32(Console.ReadLine()); 
 
//             if (a % 2 == 0)
//             {
//                 Console.WriteLine("четное число");
           
//             }
//             else
//             {
//                 Console.WriteLine("нечетное");
//             }
 
 
 
//             Console.ReadKey();
//         }
//     }
// }


// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N


// namespace ConsoleApplication1
//  {
//      class Program
//      {
//          static void Main(string[] args)
//          {
//              int a;                             
//              Console.WriteLine("введите число: ");
//              a = Convert.ToInt32(Console.ReadLine()); 
//              int num = 2;
// for (int i=0; i<20; i++)
// {
//     Console.WriteLine(num);
//     num = (-(~num)); num = (-(~num));
// }
 
//              if (a % 2 == 0)
//              {
//                  Console.WriteLine("четные числа");
           
//              }
//              else
//              {
//                  Console.WriteLine("нечетные числа");
//              }
 
 
 
//              Console.ReadKey();
//          }
//      }
//  }
